In [1]:
import pandas as pd
import numpy as np

In [2]:
school_csv = "Resources/schools_complete.csv"
student_csv = "Resources/students_complete.csv"

In [3]:
school_df = pd.read_csv(school_csv)
student_df = pd.read_csv(student_csv)

In [9]:
school_df = school_df.rename(columns={"name":"school"})
df = pd.merge(school_df, student_df, on="school")
df.head()

,School ID,school,type,size,budget,Student ID,name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [10]:
df['School ID'].nunique()

15

In [11]:
df['Student ID'].nunique()

39170

In [13]:
school_df['budget'].sum()

24649428

In [14]:
df['reading_score'].mean()

81.87784018381414

In [15]:
df['math_score'].mean()

78.98537145774827

In [18]:
df.groupby(['school']).agg({'Student ID':['count'], 'reading_score':['mean'], 'math_score':['mean']})

                      Student ID reading_score math_score
                           count          mean       mean
school
Bailey High School          4976     81.033963  77.048432
Cabrera High School         1858     83.975780  83.061895
Figueroa High School        2949     81.158020  76.711767
Ford High School            2739     80.746258  77.102592
Griffin High School         1468     83.816757  83.351499
Hernandez High School       4635     80.934412  77.289752
Holden High School           427     83.814988  83.803279
Huang High School           2917     81.182722  76.629414
Johnson High School         4761     80.966394  77.072464
Pena High School             962     84.044699  83.839917
Rodriguez High School       3999     80.744686  76.842711
Shelton High School         1761     83.725724  83.359455
Thomas High School          1635     83.848930  83.418349
Wilson High School          2283     83.989488  83.274201
Wright High School          1800     83.955000  83.682222

In [24]:
school_df[['school','budget']]

                   school   budget
0       Huang High School  1910635
1    Figueroa High School  1884411
2     Shelton High School  1056600
3   Hernandez High School  3022020
4     Griffin High School   917500
5      Wilson High School  1319574
6     Cabrera High School  1081356
7      Bailey High School  3124928
8      Holden High School   248087
9        Pena High School   585858
10     Wright High School  1049400
11  Rodriguez High School  2547363
12    Johnson High School  3094650
13       Ford High School  1763916
14     Thomas High School  1043130